{
    "hello_old": "Hey, nice to see you again. What do you want to do?",
    "hello_new": "Welcome! What do you want to do?",
    "start_over": "Start Over",
    "start_over_confirm": "Are you sure you want to reset everything to default?",
    "start_over_yes": "Yes",
    "start_over_no": "No",
    "edit_cards": "Edit Cards",
    "view_cards": "View Cards",
    "select_card_type": "What type of card do you want to edit?",
    "build_richcard": "Rich Card",
    "build_carousel": "Carousel",
    "select_richcard_topic": "Which topic do you want to work on?",
    "richcard_layout": "Layout",
    "richCard_content": "Content",
    "what_to_change": "What do you want to change?",

    "what_to_view": "What type card do you want to view?",
    "view_richcard": "Rich Card",
    "view_carousel": "Carousel",

    "richcard_layout_current": "Current layout is: ",
    "richcard_layout_card_orientation": "Card Orientation",
    "richcard_layout_image_alignment": "Image Alignment",
    "richcard_layout_what_orientation": "How is the rich card orientated?",
    "richard_layout_orientation_vertical": "VERTICAL",
    "richard_layout_orientation_horizontal_left": "HORIZONTAL LEFT",
    "richard_layout_orientation_horizontal_right": "HORIZONTAL RIGHT",
    
    "richcard_content_task": "Which part do you want to modify?",
    "richcard_content_media": "Media",
    "richcard_content_title": "Title",
    "richcard_content_description": "Description",
    "richcard_content_suggestions": "Suggestions",
    
    "hello": "Hello World! I am CoCo!🐶",
    "default": "🐶This is CoCo. I am sorry I don't understand what you are just saying: ",    
    
    "test_10776": "10776",
    "test_advanced": "Advanced Functions",
    "what_to_test": "OK, please tell me what you want to test.",
    "test_carousel_adv": "Advanced Carousel Test",
    "test_richcard_adv": "Advanced Rich Card Test",
    "test_api": "API",
    "test_bot_interaction": "💌Bot Interaction",    
    "test_chiplist_10776": "🍕Chip List",
    "test_richcard_10776": "💲Rich Card",
    "test_carousel_10776": "🎠Carousel",
    "test_send_msg_to_coco": "📩Send message to CoCo",
    "test_receive_msg_from_coco": "📫Receive message from CoCo",
    
    "test_send_text_to_coco": "🀄Text",    
    "test_send_file_to_coco": "💾File",    
    "what_msg_to_send": "What kind of message do you want to send?",
    "send_text_to_coco": "Please type and send \n♦a short (< 1024 bytes) message starting with '10776 read receipt' \n♦or a long (> 1024 bytes) message starting with '10776 no read receipt'. \n⛔I will send you the expected result after I received your message. Please report the issue if you don't see it.",
    "send_text_to_coco_not_long_enough": "The message you sent is not long enough although I still send only deliver recipt to fulfill part of the test. \n⛔Your message status should be 'Delivered' otherwise please report the issue. \n\nPlease type and a long (> 1024 bytes) message starting with '10776 no read receipt', or what kind of message do you want to send?",
    "send_text_to_coco_too_long": "The message you sent is too long alothough I still send read recipt to fulfill part of the test. \r\n\n⛔Your message status should be 'Delivered' otherwise please report the issue. \r\nPlease type and send a short (< 1024 bytes) message starting with '10776 read receipt', or what kind of message do you want to send?",
    "test_read_receipt": "I received your message starting with '10776 read receipt' and I sent both deliver and read receipt back. \r\n\n⛔Your message status should be 'Read' otherwise please report the issue. What kind of message do you want to send?",
    "test_no_read_receipt": "I received your message starting with '10776 no read receipt' and I sent only the deliver receipt back and did not send the read receipt. \r\n\n⛔Your message status should be 'Delivered' otherwise please report the issue. \r\nWhat kind of message do you want to send?",
    "select_file": "📎Please select and send a file to me and I will send it back to you.",
    "received_file": "I am sending back the file I rceived. \r\n⛔For image files, read receipt will be sent; for all other file types, only delivery report will be sent.\r\n⛔You should see the exact file you sent to me otherwise please report the issue. What else do you want to test?",

    "test_receive_short_text_from_coco": "👡Short Text",
    "test_receive_long_text_from_coco": "👢Long Text",
    "test_receive_image_from_coco": "🖼Image",
    "test_receive_audio_from_coco": "🎷Audio",
    "test_receive_video_from_coco": "🎥Video",
    "test_receive_gif_from_coco": "🏁GIF",
    "what_msg_to_receive": "What kind of message do you want to receive?",
    "receive_image_file": "I am sending an image file to you. \r\n⛔Please report the issue if you don't receive it after a while.",
    "receive_audio_file": "I am sending an audio file to you. \r\n⛔Please report the issue if you don't receive it after a while.",
    "receive_video_file": "I am sending a video file to you. \r\n⛔Please report the issue if you don't receive it after a while.",

    "richcard_basic": "This is not a test case but let you know the basic of a general purpose standalone rich card. \n♦A rich card may contain media, title, description, list of suggested replies, and list of suggested actions. \n♦At least one of media, title, or discription shall be included. \n♦Suggested replies shall always appear before suggested actions. \n♦Tapping an image/GIF in a rich card opens the image/GIF in full-screen mode. Tapping a video or audio file plays the file. A client may provide an affordance to play a video or audio file inline vs. full screen.\n♦The width of a standalone card will always be the same in both portrait and landscape mode for a given device. \n♦Standalone cards have a MIN_CARD_HEIGHT: 112 DP and MAX_CARD_HEIGHT: 344 DP. \n♦If the fields of a card are not large enough to fill the MIN_CARD_HEIGHT, then the card is expanded with white space at the bottom. \n♦If a card will exceed the MAX_CARD_HEIGHT, then the fields are truncated in the following order until it will not exceed MAX_CARD_HEIGHT: description → title → suggested actions (starting from the end of the list) → suggested replies (starting from the end of the list). \n♦A media file: image, GIF, video, or audio file, extends to the edges of the card on all sides, except for the bottom when there are other specified fields. \n♦If a card contains a media file and no other fields, then the media extends to all edges. \n♦For a standalone card or MEDIUM_WIDTH carousel card, the developer can choose one of three heights for the media: SHORT_HEIGHT: 112 DP, MEDIA_HEIGHT: 168 DP, TALL-HEIGHT: 264 DP. \n♦A standalone can choose to have its media file on the right side or left side when the card orientation is orizontal. In these cards, the displayed image should always be HORIZONTAL_LAYOUT_MEDIA_WIDTH: 128 DP. \n♦The title text wraps if it exceeds the width of the card. There is no line limit for the title text (up to 200 characters), although it can be truncated due to max card height constraints. \n♦The description text wraps if it exceeds the width of the card. There is no limit to how many lines of description text (up to 2000 characters). However, this is the first field to be truncated if the card exceeds the maximum total height.",
    "test_richcard_learn": "❓Learn more",
    "test_richcard_back": "🔙Back to test",
    "what_media_type_richcard": "What's the media type in the rich card?",
    "test_receive_normal_richcard": "Normal",
    "test_receive_no_thumbnail_richcard": "No Thumbnail",
    "test_receive_broken_thumbnail_richcard": "Broken Thumbnail Only",
    "test_receive_broken_file_richcard": "Broken File Only",
    "test_receive_all_broken_richcard": "Broken Thumbnail and Broken File",
    "normal_richcard": "Normal rich card with working thumbnail and file. \r\n⛔Please report the issue if you see thumbnail or file is missing from the rich card.",
    "no_thumbnail_richcard": "Rich card without thumbnail but with working file. \r\n⛔If media is image, then even if thumbnial is missing, you should see still see the image in the first place instead of a broken icon. Please report the issue if that is not the case. \r\n⛔For other media types, the media icon should be presented because the thumbnail is missing. Please report the issue is this is not the case.",
    "broken_thumbnail_richcard": "Rich card with broken thumbnail and working file. \r\n⛔If media is image, then even if thumbnial is broken, you should see still see the image in the first place instead of a broken icon. Please report the issue if that is not the case. \r\n⛔For other media types, the media icon should be presented because the thumbnail is broken. Please report the issue is this is not the case.",
    "broken_file_richcard": "Rich card with working thumbnail and broken file. \r\n⛔Please report the issue if you don't see the thumbnail. \r\n⛔Because the file is broken, you should not be able to open/play/see the actual media. Please report the issue if that is not the case.",
    "all_broken_richcard": "Rich card with broken thumbnail and broken file.\r\n⛔Please report the issue if you see either thumbnail or file is in the rich card.",
    "test_receive_image_richcard": "🖼Image",
    "test_receive_audio_richcard": "🎷Audio",
    "test_receive_video_richcard": "🎥Video",
    "test_receive_gif_richcard": "📦GIF",
    "what_feature_richcard": "What kind of feature of rich card do you want to test?",
    "test_richcard_reply_action": "Reply/Action",
    "reply_action_order": "Suggested replies shall always appear before suggested actions. I am sending suggested actions before suggested replies and you should see suggested replies appear before suggested actions. \r\n⛔Please report the issue if you see suggested action first (open website)",
    "reply_action_order_issue": "⛔Please report the issue if you see suggested action first (open website)",
    "test_richcard_reply_action_order": "Order",
    "test_richcard_reply_action_char": "Max Characters",
    "reply_action_char": "The text label for a given suggested reply or action is truncated after a maximum of 25 characters. I am sending 26 characters, from A to Z",
    "reply_action_char_issue": "⛔Please report the issue if you see they are truncated BEFORE 25 characters or not truncated at all",
    "reply_action_char_26": "abcdefghijklmnopqrstuvwxyz",
    "test_richcard_reply_action_11": "Max Replies/Actions",
    "reply_action_11": "At most 11 combined suggested replies and actions can be included in a single card. \r\n♦However, it is highly unlikely that 11 suggested replies and actions can be rendered given max card height constraints and the truncation logic. \r\n♦I am sending 12 replies/actions. \r\n⛔Please report issue if you see the 12th reply/action.",
    "test_richcard_orientation": "Orientation",
    "test_richcard_orientation_left": "Left",
    "test_richcard_orientation_right": "Right",
    "test_richcard_orientation_vertical": "Vertical",
    "richcard_orientation": "A standalone card can choose to have its media file in landscape or portrait mode. For landscape mode,  its media file on the right side (this is flipped to the left side for right-to-left languages) or left side. \r\n♦The width of a standalone card will always be the same in both portrait and landscape mode for a given device. For horizontal cards, the displayed media should always be HORIZONTAL_LAYOUT_MEDIA_WIDTH = 128 DP.\r\n⛔Please report the issue if you see any of these is not supported correctly or ⛔the displayed media width is not HORIZONTAL_LAYOUT_MEDIA_WIDTH = 128 DP.",
    "richcard_orientation_issue": "⛔Please report the issue if you see the orientation does not match your selection or ⛔the displayed media width is not 128 DP.",
    "test_richcard_content": "Contents",
    "test_richcard_content_title": "Title only",
    "test_richcard_content_description": "Description only",
    "test_richcard_content_image": "Image only",
    "test_richcard_content_gif": "GIF only",
    "test_richcard_content_video": "Video only",
    "test_richcard_content_audio": "Audio only",
    "test_richcard_content_reply_action": "Reply/Action only",
    "test_richcard_content_title_description": "Title & Description",
    "test_richcard_content_media_title": "Media & Title",
    "test_richcard_content_media_description": "Media & Description",
    "test_richcard_content_title_reply": "Title & Reply",
    "test_richcard_content_description_reply": "Description and Reply",
    "richcard_content": "A general purpose card contains the following generic fields: 1. media; 2. title; 3. description; 4. suggested replies; 5. suggested actions. \n♦Each of these fields is optional, although at least one of fields 1-3 must be included to form a viable general purpose card. \r\n⛔Please report the issue if you see any of these is not supported correctly.",
    "richcard_content_issue": "⛔Please report the issue if you see the content you selected does not display correctly.",
    "richcard_content_issue_reply_action": "⛔This should not be allowed. So if you see the rich card in the next message, then report the issue.",
    "test_richcard_layout": "Dimensions & Layout",
    "test_richcard_layout_width": "Width",
    "test_richcard_layout_width_issue": "A general purpose card that is not part of a carousel should expand in width to the smaller of either:\r\n♦<width of the phone in portrait mode> - <width of the margins on either side of a card>\r\n♦MAX_STANDALONE_CARD_WIDTH = 480 DP.\r\n♦The width of a standalone card will always be the same in both portrait and landscape mode for a given device. \r\n⛔Please report the issue if you see the width does not meet these requirements. You can use 'Keyline Pushing' app from Google Play to measure.",
    "test_richcard_media": "Media",
    "test_richcard_wrap": "Wrap",
    "test_richcard_layout_height": "Height",
    "test_richcard_layout_height_min": "Min",
    "test_richcard_layout_height_max": "Max",
    "test_richcard_layout_height_description": "Long Description",
    "test_richcard_layout_height_title": "Long Title",
    "test_richcard_layout_height_action": "Long Action List",
    "test_richcard_layout_height_reply": "Long Reply List",    
    "what_height_richcard": "Please select the height of the rich card.",
    "what_height_case_richcard": "Please select the test case for height of the rich card.",
    "test_richcard_layout_height_min_issue": "Standalone cards have a \r\n♦MIN_CARD_HEIGHT = 112 DP. \r\n♦If the fields of a card are not large enough to fill the MIN_CARD_HEIGHT, then the card is expanded with white space at the bottom. \r\n⛔Please report the issue if you see the height does not meet these requirements. You can use 'Keyline Pushing' app from Google Play to measure.",
    "short_description_richcard": "A short description.",
    "test_richcard_layout_height_max_issue": "Standalone cards have a \r\n♦a MAX_CARD_HEIGHT = 344 DP. \r\n♦If a card will exceed the MAX_CARD_HEIGHT, then the fields are truncated in the following order until it will not exceed MAX_CARD_HEIGHT: (3) description → (2) title → (5) suggested actions starting from the end of the list) → (4) suggested replies (starting from the end of the list). \r\n⛔Please report the issue if you see the height does not meet these requirements. You can use 'Keyline Pushing' app from Google Play to measure.",
    "long_title_richcard": "A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title. A long title.",
    "long_desc_richcard": "A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. A long description. ",
    "super_long_desc_richcard": "A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. A super long description. ",
    "sending_long_description": "\r\n♦I am sending a long description and it should be truncated.",
    "sending_long_title": "\r\n♦I am sending a long title and it should be truncated.",
    "sending_long_action": "\r\n♦I am sending a 10 actions and 1 reply and actions should be truncated.",
    "sending_long_reply": "\r\n♦I am sending a 1 action and 10 replies and both action and replies should be truncated.",
    "test_richcard_media_edge": "Edge",
    "test_richcard_media_edge_image": "🖼Image",
    "test_richcard_media_edge_gif": "📦GIF",
    "test_richcard_media_edge_video": "🎥Video",
    "test_richcard_media_edge_audio": "🎷Audio",
    "test_richcard_media_edge_issue": "A media \r\n♦extends to the edges of the card on all sides, except for the bottom when there are other specified fields. \r\n♦If a card contains a media file and no other fields, then the media extends to all edges. Please report the issue \r\n⛔if the media does not extend to all edges, \r\n⛔or is less than 112 DP.",
    "test_richcard_media_height": "Height",
    "test_richcard_media_height_short": "Short",
    "test_richcard_media_height_mid": "Medium",
    "test_richcard_media_height_tall": "Tall",
    "test_richcard_media_height_issue": "For a standalone card, the developer can choose one of three heights for the media:\r\n♦ SHORT_HEIGHT = 112 DP. \r\n♦MEDIUM_HEIGHT = 168 DP. \r\n♦TALL_HEIGHT = 264 DP.\r\n⛔Please report the issue if the media height does not meet the specification ",
    "test_richcard_wrap_title": "Title",
    "test_richcard_wrap_desc": "Description",
    "test_richcard_wrap_title_desc": "Title & Description",
    "test_richcard_wrap_title_issue": "The title text wraps if it exceeds the width of the card. There is no line or character limit for the title text, although it can be truncated due to max card height constraints. \r\n⛔Please report issue if the title truncates BEFORE reaching MIN_CARD_HEIGHT 112 DP, \r\n⛔or does not wrap at all",
    "test_richcard_wrap_desc_issue": "The description text wraps if it exceeds the width of the card. There is no limit to how many lines of description text. \r\n⛔Please report issue if the description truncates BEFORE reaching MIN_CARD_HEIGHT 112 DP, \r\n⛔or does not wrap at all",
    "test_richcard_wrap_title_desc_issue": "The description is the first field to be truncated if the card exceeds the maximum total height. \r\n⛔Please report issue if the title or description truncates BEFORE reaching MAX_CARD_HEIGHT 344 DP, \r\n⛔or does not wrap at all",

    "chip_list_basic": "This is not a test case but let you know the basic of the suggested chip list. \n♦Up to 11 chips allowed and each chip can be suggested reply or suggested action. \n♦Suggested replies shall always appear before suggested actions. \n♦The text label for a given suggested reply or action is truncated after a maximum of 25 characters. \n♦Suggested chip list must not be shown if it is not associated the most recent message. \n♦Tapping on a suggested action shall not dismiss the entile suggested chip list. If certain actions are not supported by the operator, the cooresponding chip shall be greyed out or invisible. Thus there's a possibility that you will see less actions than what the Chatbot sends.",
    "what_action_type_chiplist": "What type of suggested action do you want to test?",
    "what_message_type_chiplist": "What type of message with suggested chip list to do you want to test? I would suggest you to start with Text to get familar with each test case.",
    "test_url_action": "☸URL",
    "test_dialer_action": "📠Dialer",
    "test_map_action": "🗺Map",
    "test_calendar_action": "📅Calendar",
    "test_compose_action": "📧Message",
    "test_device_action": "🏧Device",
    "test_settings_action": "🔧Settings",
    "test_chiplist_learn": "❓Learn more",
    "test_chiplist_back": "🔙Back to test",
    "test_text_with_chiplist": "🀄Text",
    "test_file_with_chiplist": "💾File",
    "test_richcard_with_chiplist": "💲Rich Card",
    "test_openUrl_action": "☸Open URL",
    "test_dialPhoneNumber_action": "📠Dial Phone Number",
    "test_dialEnrichedCall_action": "📠Dial Enriched Call",
    "test_dialVideoCall_action": "📠Dial Video Call",
    "test_showLocation_action": "🗺Show Location",
    "test_showLocationWithQuery_action": "🗺Show Location With Query",
    "test_requestLocationPush_action": "🗺Request Location Push",
    "test_createCalendarEvent_action": "📅Create Calendar Event",
    "test_composeTextMessage_action": "📧Compose Text Message",
    "test_composeRecordingVideoMessage_action": "📧Compose Recording Video Message",
    "test_composeRecordingAudioMessage_action": "📧Compose Recording Audio Message",
    "test_requestDeviceSpecifics_action": "🏧Request Device Specifics",
    "test_disableAnonymization_action": "🔧Disable Anonymization",
    "test_enableDisplayedNotifications_action": "🔧Enable Displayed Notifications",
    "test_chiplist_10776_with_text": "This is a text message with suggested chip list. \r\n⛔Please report the issue if you don't see the suggested chip list.",
    "test_text_with_url_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Open URL action shall open the given URL in a browser in-app webview. I am sending 1 suggested action. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_dialer_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Dialer actions shall use the dialer to make calls (normal voice call, RCS enriched calling, and video call) to a Chatbot defined phone number. I am sending 3 suggested actions. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_map_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Map actions shall either open the map app to a position indicated by the Chatbot, or ask the user to share the current location through RCS Geolocation Push. The position indicated by the Chatbot can be either latitude-longitude coordinates or a search query around the user's current location. When asking the user to share the current location, the user shall be provided an option to agree to do so. The user's location information can be sent to the Chatbot, invisibly, only after the user agrees each time. I am sending 3 suggested actions. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_calendar_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Calendar actions shall open the user's calendar app to the new event page, with start time, end time, title, and description pre-filled. I am sending 1 suggested action. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_compose_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Message actions shall send message, text or audio/video, to a defined destination. For audio/video message, the recording interface shall be provided. I am sending 3 suggested actions. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_device_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Device actions shall ask for the user' permission to send device status to the Chatbot. Status information includes device model, OS version, messaging client identifier and version, and remaining battery charge in minutes. The status information can be sent to the Chatbot, invisiblely, only after the user agrees each time. I am sending 1 suggested actions. \r\n⛔Please report the issue if you see anything different from the description here.",
    "test_text_with_settings_action_in_chiplist": "This is a text message with suggested chip list. \r\n⛔Tap the suggested action should not make the chip list disappear. Please report the issue if you different behaviors. \n♦If certain suggested action is not supported by the device, the specific chip itself may be invisible. \n♦Setting actions shall ask for the user' permission to share his/her MSISDN if the conversation is in anonymous mode, or enable providing read recipt for this conversation. These are settings related actions, so the user shall be directed to the settings screen. \r\n♦I am sending 2 suggested actions. Currently both actions are not supported so they should be invisible. \r\n⛔Please report the issue if you see anything different from the description here.",

    "carousel_basic": "This is not a test case but let you know the basic of the carousel. \n♦There must be at least 2 and up to 10 cards within a carousel. If more than 10 cards are sent within the same message, the client can either ignore the additional cards or it can choose to load them on an asynchronous basis, e.g. when the user begins scrolling. \n♦Suggested replies shall always appear before suggested actions. \n♦The developer chooses whether the cards in the carousel should have SMALL_WIDTH: 120 DP or MEDIUM_WIDTH: 232 DP. \n♦MEDIUM_WIDTH carousel cards have the same min and max heights as standalone cards. SMALL_WIDTH carousel cards have the same min height but a smaller max height: MAX_SMALL_WIDTH_CARD_HEIGHT: 224 DP. \n♦For a MEDIUM_WIDTH carousel card, the developer can choose one of three heights for the media: SHORT_HEIGHT: 112 DP, MEDIA_HEIGHT: 168 DP, TALL-HEIGHT: 264 DP. For a SMALL_WIDTH carousel card, the developer can choose only SHORT_HEIGHT and MEDIUM_HEIGHT. \n♦Within a carousel, the fields within all cards must be vertically aligned. This is accomplished through the following rules: \n♦All media files within the cards must have the same height. \n♦All title fields within the cards must have the same height, which is the height of the largest title text field. \n♦Title fields with fewer lines are padded with whitespace below the text to match the height of the largest title field. \n♦Description fields and suggested replies/actions follow the same logic as title fields for height matching.",
    "test_carousel_learn": "❓Learn more",
    "test_carousel_full": "🎠Full carousel",
    "test_carousel_back": "🔙Back to test",
    "test_carousel_send_full": "I am sending a carousel with suggested chip list. \r\n⛔Please report the issue if you don't see it. \r\n⛔After you see it, please closely check the UI and see if it complaints with the requirements specified in the 'learn more' section and report every issue.",
    "test_carousel_card_url": "Carousel card with 1 URL action and 2 replies.",
    "test_carousel_card_dialer": "Carousel card with 3 dialer actions and 2 replies.",
    "test_carousel_card_map": "Carousel card with 3 map actions and 2 replies.",
    "test_carousel_card_calendar": "Carousel card with 1 calendar action and 2 replies.",
    "test_carousel_card_compose": "Carousel card with 3 compose actions and 2 replies.",
    "test_carousel_card_device": "Carousel card with 1 device actions and 2 replies.",
    "test_carousel_card_settings": "Carousel card with 2 settings actions and 2 replies.",
    "test_carousel_card_none": "Carousel card with no action and 2 replies.",    
    "what_feature_carousel": "What kind of feature of carousel do you want to test?",
    "test_carousel_layout": "Dimensions & Layout",
    "test_carousel_layout_width": "Width",
    "test_carousel_layout_width_small": "Small",
    "test_carousel_layout_width_mid": "Medium",
    "what_width_carousel": "Please select the width of the carousel.",
    "test_carousel_layout_width_issue": "For general purpose cards that are part of a carousel, the developer chooses whether the cards in that carousel should have \r\n♦SMALL_WIDTH: 120 DP \r\n♦or MEDIUM_WIDTH: 232 DP.\r\n⛔Please report the issue if the width are the same for both selections.",
    "test_carousel_layout_height": "Height",
    "test_carousel_layout_height_min_small": "Min_Small_Width",
    "test_carousel_layout_height_min_mid": "Min_Medium_Width",
    "test_carousel_layout_height_max_small": "Max_Small_Width",
    "test_carousel_layout_height_max_mid": "Max_Medium_Width",
    "what_height_carousel": "Please select the height of the rich card.",
    "test_carousel_layout_height_issue_min": "SMALL_WIDTH and MEDIUM_WIDTH carousel cards have the same min heigh as standalone cards: MIN_CARD_HEIGHT=112 DP\r\n⛔Please report the issue if the height is less than 112 DP.",
    "test_carousel_layout_height_issue_max_small": "SMALL_WIDTH carousel cards have a smaller max height: MAX_SMALL_WIDTH_CARD_HEIGHT = 224 DP\r\n⛔Please report the issue if the height is more than 224 DP.",
    "test_carousel_layout_height_issue_max_mid": "MEDIUM_WIDTH carousel cards have the same max heights as standalone cards: MAX_CARD_HEIGHT= 344 DP\r\n⛔Please report the issue if the height is more than 344 DP.",
    "test_carousel_media": "Media",
    "test_carousel_media_height_small": "Small Width", 
    "test_carousel_media_height_small_issue": "For a SMALL_WIDTH carousel, the developer can choose one of 2 heights for the media:\r\n♦ SHORT_HEIGHT = 112 DP. \r\n♦MEDIUM_HEIGHT = 168 DP. \r\n⛔Please report the issue if the media height does not meet the specification or ⛔Tall media is displayed.",
    "test_carousel_media_height_small_short": "Short",
    "test_carousel_media_height_small_mid": "Medium",
    "test_carousel_media_height_small_tall": "Tall",
    "test_carousel_media_height_mid": "Medium Width",
    "test_carousel_media_height_mid_issue": "For a MEDIUM_WIDTH carousel, the developer can choose one of 3 heights for the media:\r\n♦ SHORT_HEIGHT = 112 DP. \r\n♦MEDIUM_HEIGHT = 168 DP. \r\n♦TALL_HEIGHT = 264 DP.\r\n⛔Please report the issue if the media height does not meet the specification.",
    "test_carousel_media_height_mid_short": "Short",
    "test_carousel_media_height_mid_mid": "Medium",
    "test_carousel_media_height_mid_tall": "Tall",
    "test_carousel_display": "Alignment & Number",
    "test_carousel_display_align": "Alignment",
    "test_carousel_display_align_issue": "Within a carousel, the fields within all cards must be vertically aligned.\r\n♦All media files within the cards must have the same height.\r\n♦All title fields within the cards must have the same height, which is the height of the largest title text field. Title fields with fewer lines are padded with whitespace below the text to match the height of the largest title field.\r\n♦Description fields and suggested actions follow the same logic as title fields for height matching. \r\n⛔Please report the issue if any of these are not aligned.",
    "test_carousel_display_number": "Number",
    "test_carousel_display_number_issue": "If more than 10 cards are sent within the same message, the client can either ignore the additional cards or it can choose to load them on an asynchronous basis, e.g. when the user begins scrolling.\r\n⛔Please report the issue if you see more than 10 cards in the carousel."
}